// =======================================STATERD==================================
// Develop by Md. Fahim Hossen

// ============================================================
// ১. জাভাস্ক্রিপ্ট কি জিনিস এইটা কি জানো?
/* জাভাস্ক্রিপ্ট বিশ্বের সবচেয়ে জনপ্রিয় প্রোগ্রামিং ভাষা।
জাভাস্ক্রিপ্ট হল ওয়েবের প্রোগ্রামিং ভাষা।
জাভাস্ক্রিপ্ট শেখা সহজ। */

// ============================================================
// ২. জাভাস্ক্রিপ্ট কিভাবে কাজ করে সেটা কি জানো?
/* JavaScript একটি উচ্চস্তরের ওয়েব প্রোগ্রামিং ভাষা যা ব্রাউজারে চলতে পারে। এটি প্রথমেই ব্রাউজারের দিকে লোড করা হয়। এটি সম্পাদন করার জন্য আপনার উইব পৃষ্ঠায় একটি <script> ট্যাগের মধ্যে প্রবেশ করে। ব্রাউজার এটিকে প্রথম থেকে শেষ পর্যন্ত পাঠ করে এবং নির্দিষ্ট অ্যাকশানগুলি সম্পাদন করে। */

// ============================================================
// ৩. ভেরিয়েবল কি জিনিস? 
/* ভেরিয়েবল এর বাংলা অর্থ হচ্ছে চলক। আমরা গনিতে যেটা ব্যবহার করি সে রকম আর কি।
প্রোগ্রামিং এ ভেরিয়েবল বলতে র‍্যাম এর একটি জায়গা বোঝায় যেখানে আমরা কোনো ডাটা রাখতে পারি। 
যেমন একটা গ্লাসে যখন পানি রাখি তথন সেটা পানির পাত্র গ্লাস যেকোনো জায়গায় নিয়ে যাওয়া মানে পানি নিয়ে যাওয়া। আবার ঐ পানির পাত্রে দুধ রাখলে সেটা দুধের পাত্র হয়ে যাবে।
example:- var a = 45; let b = 30;
*/

// ============================================================
// ৪. ভেরিয়েবল কিভাবে ডিক্লেয়ার করে 

// var a = 20;
// let b = 20;
// const c = 20;

// ============================================================
// ৫. ভেরিয়েবল এর মান কিভাবে চেইঞ্জ করে বা আপডেট করে। 

// var a = 20;
// a = 30;
// console.log(a);
// ============================================================
// ৬. কি কি ধরণের ভেরিয়েবল হয়। সেগুলা কি কি (হিন্টস: Numeric, String, Boolean)
// var,let,const

// ============================================================
// ৭. জাভাস্ক্রিপ এ primitive and non primitive data types কি কি ? উদাহরণ হিসেবে বলো। 

// জাভাস্ক্রিপ্টে 2 প্রকার তথ্য বা data রয়েছে, এগুলো হল নিম্নরূপ।

// Primitive ডাটা টাইপ এবং
// Non-primitive বা reference ডাটা টাইপ
// Primitive ডাটা টাইপ
// জাভাস্ক্রিপ্টে 5 প্রকার Primitive ডাটা টাইপ রয়েছে। এগুলো হল নিম্নরূপ -

// String -
// Number - গাণিতিক বা numeric মান নির্ধারণ করে,
// Undefined - Undefined মান নির্ধারণ করে,
// Boolean - কেবল মাত্র দুইটি মান বা value ব্যবহার করে অর্থাৎ "true" এবং "false" ব্যবহার করে মান নির্ধারণ করে,
// Null - শূন্য বা null মান নির্ধারণ করে,
// Non-primitive বা reference ডাটা টাইপ
// জাভাস্ক্রিপ্টে 3 প্রকার Non-primitive বা reference ডাটা টাইপ রয়েছে। এগুলো হল নিম্নরূপ -

// Object -
// Array - একই রকম মান বা value গুলোর গুচ্ছ বা group তৈরি করে,
// RegExp - regular expression গুলো তৈরি করে,

// ==========================================================
// ৮. ভেরিয়েবল এর নাম কিভাবে কিভাবে ডিক্লেয়ার করতে হয়। কোন কোন জিনিস নাম এ লেখা যাবে না। অর্থাৎ Variable এর naming convention সম্পর্কে বলো। 
// var a = 20;
// a = 30;
// let b = 20;
// b = 30 ei vabe lekha jabe but const jabe na jemon const c = 30; c = 30; hobe na.
// variable number diye hobe na speech hole hobe na.
// var 234 = 20; not working
// var h g = 30; not working
// var a = sdufh; not working

// =============================================================
// ৯. দুইটা ভেরিয়েবল এর মধ্যে =, -, *, /, % কিভাবে করে?
// var sum = a + b;
// var minus = a - b;
// var divide = a / b;
// var module = a % b;
// var multi = a * b;

// ==============================================================
// ১০. শর্টহ্যান্ড গুলো জানতে হবে। বিশেষ করে +=, -=, *=, /= জানতে হবে। 
// a += 20; a = a + 20;
// a -= 20; a = a - 20;
// a *= 20; a = a * 20;
// a /= 20; a = a / 20;

// ==============================================================
// ১১.. ++ এবং -- এর কাজ কি ? এইটা কি জানো। 

// ++ mane increment eita mane ak ak kore man barai.
// -- mane decrement eita mane ak ak kore man komai.
// var a = 20;
// a++;
// a--;
// console.log(a);

// ===============================================================
// ১২ parseInt, parseFloat, toFixed এইগুলা কি করে? 

// parseInt mane integer number.
// parseFloat mane Floating number ottak . er porer je number show kore thake float bola hoy.
// toFixed mane . er onek number hoye gele se gula komanor jonno use kore.
// Example:-
// var int = 20.223;
// var b = parseInt(int);
// console.log(b);
// var float = 20.7230090;
// var b = parseFloat(float);
// console.log(b);
// var fixed = 20.7230090;
// var b = parseFloat(fixed).toFixed(2);
// console.log(b);

// =================================================================
// ১৩. Array কি জিনিস। এইটা কিভাবে কাজ করে? কিভাবে Array ডিক্লেয়ার করতে হয়

// অ্যারে (array) হল একই টাইপের একাধিক ভেরিয়েবল এর সংগ্রহ যা মেমরির কাছাকাছি লোকেশনে ডাটা স্টোর করে।
// সি প্রোগ্রামিং ল্যাঙ্গুয়েজে প্রাপ্ত ডেটা টাইপ যা ইন্টিজার, কেরেক্টার, ফ্লোট ইত্যাদি সংরক্ষণ করতে পারে।
// এতে পয়েন্টার, স্ট্রাকচার, এবং লিংক লিস্ট আকারে ডেটা সঞ্চয় করার ক্ষমতাও রয়েছে। অ্যারে হল সহজ ডেটা স্ট্রাকচার যেখানে প্রতিটি ডাটা উপাদানকে এর সূচী নম্বর ব্যবহার করে এলোমেলোভাবে অ্যাক্সেস করা যায়।

// var name = ["Shariar" , "Imran" , "Jamal" , "Sagor" , "Sufian", "Shuvo"];
// console.log(name);

// =================================================================== 
// ১৪. Array এর মধ্যে কয়টা উপাদান (Element) আছে সেটা কিভাবে বের করে 

// var name1 = ["Shariar" , "Imran" , "Jamal" , "Sagor" , "Sufian", "Shuvo"];
// var t = name1.length;
// console.log(t);

// ===================================================================
// ১৫. array এর উপাদান গুলা এর পজিশন ( index) কিভাবে কাজ করে। কত দিয়ে শুরু হয়। এবং মান কিভাবে চেইঞ্জ হয়। 

// array index start hoi 0 diye, and proti index increament by 1 for every element.
// const b = [1,2,3,4,5,8];
// b[1] = 'Fahim';
// console.log(b);
// ===================================================================

// ১৬. কোন একটা উপাদানের index এর মান -১ বলতে কি বুঝায় 

// var a = [2,3,7,9,5];
// var b = a.indexOf(8); >returns -1 if the value is not found.
// console.log(b);
// ===================================================================

// ১৭. কিভাবে index দিয়ে কোন একটা array এর মধ্যে উপাদান এর মান খুঁজে বের করতে পারো

// inex number count hoi first 0 diye ottat 5 mane index hobe 4 example

// ==================================================================
// ১৮. কিভাবে কোন একটা index পজিশন এ array এর উপাদান এর মান চেইঞ্জ করতে পারবে 

// const array = [3,4,1,2,9,7,8];
// array[2] = 4;
// console.log(array);

// ===================================================================
// ১৯. একটা Array এর মধ্যে কোন একটা উপাদান এর মান তোমাকে দেয়া আছে এখন সেটার index তুমি কিভাবে খুঁজে বের করতে পারো?

// const array = [2,5,6,8,3,5,'Fahim'];
// var b = array.indexOf(8);
// var c = array.indexOf(5);
// var d = array.indexOf('Fahim');
// console.log(b,c,d);

// ====================================================================
// ২০. ধরো, কোন একটা ইনডেক্স দিয়ে উপাদান খুঁজতে গেছো। কিন্তু সেটার মান না দিয়ে তোমাকে undefined দেখাচ্ছে। সেটা দেখে তুমি কি বুঝবে? (একটু গুগলে সার্চ দাও। আমরা কোর্স এ এইটা আলোচনা করিনি। তারপরেও চেষ্টা করে দেখো)

// const array = [2,4,6,8,10];
// let indexToFind = 5;
// let show = array[indexToFind];
// console.log(show);

// =====================================================================
// ২১. কোন একটা Array এর মধ্যে লাস্ট উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে শেষের উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে

// let myArray = [1, 2, 3, 4, 5];

// লাস্ট উপাদান হিসেবে 6 যোগ করা
// myArray.push(6);

// console.log(myArray); // [1, 2, 3, 4, 5, 6]

// let lastElement = myArray.pop();

// console.log(lastElement); // এটি অবজেক্ট বা undefined হতে পারে, তাই যদি লাস্ট উপাদানটি বের করা হয় তবে এটি কনসোলে 6 দেখাবে
// console.log(myArray); // [1, 2, 3, 4, 5]
// =======================================================================
// ২২. কোন একটা Array এর মধ্যে প্রথম উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে প্রথম উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে

// const array = [2,5,7,4,8];
// array.unshift(1);
// console.log(array);
// array.shift();
// console.log(array);

// =========================================================================
// ২৩. তুলনা কিভাবে করতে হয়। এইগুলার মানে কি: >, <, ==, !=, <=, >=, ===, !==, &&, ।। 
// let a = a > b = 5 > 3;
// let b = a < b 3 < 5;
// let c = a == b উদাহরণ: 5 == "5" এই অভিবাদ সত্য হবে, তবে 5 === "5" এই অভিবাদ মিথ্যা হবে কারণ === মানে সমান এবং টাইপ একই হতে হবে।;
// let d = a != b = উদাহরণ: 5 != "5" এই অভিবাদ সত্য হবে।;
// let e = a <= b 3 <= 5;
// let f = a >= b 5 >= 3;
// let g = a === b 5===5 এটি ব্যবহৃত হয় দুইটি মান সমান এবং একই টাইপে হলে শর্ত পূরণ হয়।;
// let h = a !== b এটি ব্যবহৃত হয় দুইটি মান সমান না হলে অথবা টাইপ সমান না হলে শর্ত পূরণ হয়। // উদাহরণ: 5 !== "5" এই অভিবাদ সত্য হবে
// let i = a && b and logic example (5 == 5) && (5 == 5) 2 ta soman hote hobe;
// let j = a || b or login example (5 == 5) || (5 == 4) je kono akta sotto hole hobe;

// ==========================================================================
// ২৪. তোমার কাছে: ৮০০০০ টাকার বেশি হলে তুমি mac কিনবে, ৬০ টাকার বেশি হলে gaming ল্যাপটপ কিনবে, ৪০ হাজার টাকার বেশি হলে lenovo yoga কম্পিউটার কিনবে , ২০ হাজার টাকার বেশি হলে পুরান ল্যাপটপ কিনবে। না হয় তুমি মোবাইল দিয়ে কাজ চালাবে। 

// let a = 80000;
// if(a > 80000){
//     console.log("yes, i will mac buy");
// }else if(a > 60000){
//     console.log("yes, i will gaming laptop buy");
// }else if(a > 40000){
//     console.log("yes, i will lenovo yoga computer buy");
// }else if(a > 20000){
//     console.log("yes, i will second hand laptop buy");
// }else{
//     console.log("Ohh ohh! kisu holo na just akta normal mobile use");
// };

// =======================================================================
// ২৫. আসকে আমার মন ভালো নেই এই কথা ৩৯ বার আউটপুট হিসেবে দেখাও। 
// let txt = '';
// for(i = 0; i < 39; i++){
//     txt += "আসকে আমার মন ভালো নেই";
// }
// console.log(txt);

// =====================================================================
// ২৬. while লুপ কিভাবে কাজ করে 

// JavaScript এ while লুপটি এমন একটি লুপ যা একটি শর্ত সত্ত্বেও একটি ব্লক কোড চালাতে থাকে যতক্ষণ পর্যন্ত সেই শর্তটি সত্য থাকে।
// let text = "";
// let i = 0;
// while (i < 10) {
//   text += "<br>The number is " + i;
//   i++;
// }
// console.log(text);

// ====================================================================
// ২৭. for লুপ কিভাবে কাজ করে 
// JavaScript এ for লুপটি একটি সহজ ও প্রস্তুতি প্রদান করা মাধ্যমে একই ধরনের কোডকে প্রসারিত করার জন্য ব্যবহৃত হয়।
// for(i = 0; i < 20; i++){
//     console.log(i);
// }

// ====================================================================
// ২৮. while লুপ এর মধ্যে লুপ ভেরিয়েবল চেইঞ্জ না করলে কি সমস্যা হয়। 
// ভেরিয়েবল চেঞ্জ না করলে লুপ চলতে থাকবে এবং ইনফিনিট লুপ হয়ে যাবে 

// ====================================================================
// ২৯. একটা কোড লিখে ৫৮ থেকে ৯৮ পর্যন্ত যত সংখ্যা আছে সেগুলাকে দেখাও 
// for(i = 58; i <= 98; i++){
//     console.log(i);
// }

// =====================================================================
// ৩০.একটা কোড লিখে ৪১২ থেকে ৪৫৬ পর্যন্ত যত জোর সংখ্যা আছে সেগুলাকে দেখাও  
// for(i = 412; i <= 456; i = i +2){
//     console.log(i);
// }

// ======================================================================
// ৩১. একটা কোড লিখে ৫৮১ থেকে ৬২৩ পর্যন্ত যত বিজোড় সংখ্যা আছে সেগুলাকে দেখাও 
// for(i = 581; i <= 623; i = i + 3){
//     console.log(i);
// }

// =======================================================================
// ৩২.while আর for loop এর মধ্যে পার্থক্য কি 
// for লুপটি সধারণভাবে একটি ইটারেশন এর জন্য ব্যবহার হয় এবং ইটারেশন একটি নির্দিষ্ট মান পর্যন্ত চলতে থাকে।
// while লুপটি একটি প্রস্তুতি এবং একটি শর্তের উপর নির্ভর করে এবং এটি শর্ত সত্য থাকতে থাকতে অব্যাহতভাবে চলতে থাকতে পারে।

// ======================================================================

// ৩৩ তুমি এতদিন যা যা জিনিস শিখছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা for লুপ দিয়ে সেই array এর সব উপাদান কে আউটপুট হিসেবে দেখাও। 
// const array = ['fahim','jgok', 'ff', 'fs', 'ad'];

// for(i = 0; i < array.length; i++){
//     console.log(array[i]);
// }
// but array er jonno of diye dekhai valo and best practice and sobai of diye dekhe example:-

// const array = ['fahim','jgok', 'ff', 'fs', 'ad'];
// for(i of array){
//     console.log(i);
// }

// ========================================================================
// ৩৪. তুমি এতদিন পর্যন্ত যে যে মডেলের মোবাইল ফোন ইউজ করেছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা while লুপ দিয়ে সেই array এর উপাদান গুলা একটা একটা করে আউটপুট হিসেবে দেখাও 
// const array = ['Symphony', 'itel', 'Redmi', 'Techno'];
// let i = 0;
// while (i < array.length) {
//     console.log(array[i]);
//     i++;
// }

// =========================================================================
// ৩৫. একটা ফর লুপ চালাও। ৩০ থেকে ৮৬ পর্যন্ত। আর এই লুপ ৪৪ এ গেলে ব্রেক করবে। সেই জিনিস কোড করে দেখাও 
// for(i = 30; i <= 86; i++){
//     if(i === 44){
//         break;
//     }
//     console.log(i);
// }

// ==========================================================================
// ৩৬. তোমার যত বই আছে সেগুলার দাম নিয়ে একটা array লিখে ফেলো। যে বই গুলোর দাম ২০০ টাকার উপরে সেগুলাকে স্কিপ করবে। অর্থাৎ সেগুলাকে আউটপুট হিসেবে দেখাবে না। বাকিদের কে আউটপুট হিসেবে দেখাবে। দেখো করতে পারো কিনা। 
// const book = ['Bangla 1st Paper', 'Bangla 2st Paper', 'English 1st Paper', 'English 2st Paper', 'ICT', 'Economy', 'Geography', 'History', 'Islam Shikkha'];
// let text = 100;
// for(i = 0; i < book.length; i++){
//     if(text < 200){
//         console.log(book[i]);
//     }else{
        
//     }
// }


// ====================================ENDED=========================================